using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace MarketPlace
{
    internal class Methods
    {

        //1. Регистрация и авторизация - 2 метода
        //2. Заполнить товар и отправить товар на модерацию
        //3. Добавить товар в маркетплейс или отклонить
        //4. Поиск нужного товара
        //5. Добавить товар в корзину
        //6. Удалить товар из корзины
        //7. Оплатить заказ
        //8. Общая сумма в корзине
        //9. Послать клиенту на почту номер заказа и чек

        //10. Сохранять логин и пароль куда-то
        //11. Сохранять каждый заказ в отельный файл
        //12. Отправлять на почту продавцу заказ и реквизиты доставки
        //13. Один и тот же товар может быть у разных продацов по разной цене
        //14. Придумать категории товаров, придумать их отличия
        //15. Придумать сортировку по цене или каким-то другим признакам


    }
}
